week2/всд_неделя2/InformationRegisters/НастройкиСистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемыНалогообложения</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяПлательщикомНДПИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереходаНаУСН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеНомерУСН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеДатаУСН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

week2/всд_неделя2/Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

week2/всд_неделя2/CommonModules/НастройкиНалоговУчетныхПолитикЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает признак необходимости применения для организации ПБУ18.
// Параметры:
//	Организация - Массив, СписокЗначений, СправочникСсылка.Организации - организация, для которой определяется необходимость применения ПБУ18;
//	Период - Дата - дата, на начало месяца которой определяется необходимость применения ПБУ18.
//
// Возвращаемое значение:
//	Булево - Истина, если организация на дату применяет ПБУ18. В противном случае - ложь.
//
Функция ПоддержкаПБУ18(Знач Организация, Период) Экспорт
	Результат = Ложь;
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак ведения учета постоянных разниц.
//
// Параметры:
//	Организация - Массив, СписокЗначений, СправочникСсылка.Организации - организация, для которой определяется признак;
//	Период - Дата - дата, на начало месяца которой определяется признак.
//
// Возвращаемое значение:
//	Булево - Истина, если организация ведет учет постоянных разниц.
//
Функция ВедетсяУчетПостоянныхИВременныхРазниц(Знач Организация, Период) Экспорт
	
	Результат = Ложь;
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак применения для организации ФСБУ 25/2018.
// Параметры:
//	Организация - Массив, СписокЗначений, СправочникСсылка.Организации - организация, для которой определяется применение ФСБУ 25/2018;
//	Период - Дата - дата, на начало месяца которой определяется применение ФСБУ 25/2018.
//
// Возвращаемое значение:
//	Булево - Истина, если организация на дату применяет ФСБУ 25/2018. В противном случае - ложь.
//
Функция ПрименяетсяФСБУ25(Знач Организация, Период) Экспорт
	Результат = Ложь;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СистемаНалогообложенияОрганизации(Организация, ДатаДействия = Неопределено, ПоУмолчанию = Истина) Экспорт
	
	СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая;
	Если ТипЗнч(Организация) = Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//++ Локализация
	Если НЕ ЗначениеЗаполнено(ДатаДействия) Тогда
		ДатаДействия = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	|ИЗ
	|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Период,
	|		Организация = ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ГоловнаяОрганизация) КАК ТаблицаСрезПоследних
	|";
	Запрос.УстановитьПараметр("Период", ДатаДействия);
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СистемаНалогообложения = Выборка.СистемаНалогообложения;
	ИначеЕсли Не ПоУмолчанию Тогда
		СистемаНалогообложения = Неопределено;
	КонецЕсли;
	//-- Локализация
	Возврат СистемаНалогообложения;
	
КонецФункции

// Возвращает применяет ли организация патенты на указанную дату
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация, по которой требуется определение
//  ДатаДействия		 - Дата - Дата, на которую требуется определение
// 
// Возвращаемое значение:
//  Булево - использует организация патенты на указанную дату
//
Функция ОрганизацияПрименяетПатенты(Организация, ДатаДействия = Неопределено) Экспорт
	
	ПрименяетсяПСН = Ложь;
	Если ТипЗнч(Организация) = Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//++ Локализация
	Если НЕ ЗначениеЗаполнено(ДатаДействия) Тогда
		ДатаДействия = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСрезПоследних.ПрименяетсяПСН КАК ПрименяетсяПСН
	|ИЗ
	|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Период,
	|		Организация = ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ГоловнаяОрганизация) КАК ТаблицаСрезПоследних
	|";
	Запрос.УстановитьПараметр("Период", ДатаДействия);
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПрименяетсяПСН = Выборка.ПрименяетсяПСН;
	КонецЕсли;
	//-- Локализация
	Возврат ПрименяетсяПСН;
	
КонецФункции

Процедура ДополнитьДоступныеПараметрыНалоговУчетныхПолитик(Список, Знач Организации, Дата = Неопределено) Экспорт
	//++ Локализация
	ПоВсемОрганизациям = Ложь;
	СистемаНалогообложенияОрганизации = Неопределено;
	ПрименяетсяУСН = Ложь;

	Если ТипЗнч(Организации) = Тип("Массив")
		ИЛИ ТипЗнч(Организации) = Тип("СписокЗначений") Тогда
		ПоВсемОрганизациям = Истина;
		Если Организации.Количество() = 1 Тогда
			Организации = Организации[0];
		КонецЕсли;
	КонецЕсли;
		
	Если ТипЗнч(Организации) = Тип("СправочникСсылка.Организации") Тогда
		СистемаНалогообложенияОрганизации = НастройкиНалоговУчетныхПолитикПовтИсп.СистемаНалогообложенияОрганизации(Организации, Дата, Истина);
		ПрименяетсяУСН = СистемаНалогообложенияОрганизации = Перечисления.СистемыНалогообложения.Упрощенная;
	КонецЕсли;
	
	Список.Добавить("НастройкиСистемыНалогообложения");
	Если ЗначениеЗаполнено(СистемаНалогообложенияОрганизации)
		Или ПоВсемОрганизациям Тогда
		Если ПрименяетсяУСН Или ПоВсемОрганизациям Тогда
			Список.Добавить("НастройкиУчетаУСН"); 
			Список.Добавить("НастройкиУчетаНДСПриУСН");
		КонецЕсли;
		
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

Процедура ТекстыЗапросовПолученияСтатистикиУчетнойПолитики(ТекстыЗапросов) Экспорт
	
	//++ Локализация
	//Регистр НастройкиСистемыНалогообложения
	ПоказателиСтатистики = "СистемаНалогообложения,
							|ПрименяетсяЕНВД,
							|ЯвляетсяПлательщикомНДПИ,
							|ПрименяетсяУСН";
	НастройкиНалоговУчетныхПолитик.ДополнитьТекстыЗапросаПоказателейСтатистики("НастройкиСистемыНалогообложения", ПоказателиСтатистики, ТекстыЗапросов);
	
	//НастройкиУчетаНДС
	ПоказателиСтатистики = "ПрименяетсяУчетНДСПоФактическомуИспользованию,
							|ПрименяетсяОсвобождениеОтУплатыНДС,
							|РаздельныйУчетТоваровПоНалогообложениюНДС,
							|РаздельныйУчетПостатейныхПроизводственныхЗатратПоНалогообложениюНДС,
							|УчетНДСДлительногоЦиклаПроизводства,
							|УчетНДСВКосмическойДеятельности,
							|ФормироватьНДСПредъявленныйПриВключенииВСтоимость,
							|РаспределятьНДСВМесяцеОсуществленияКапВложений,
							|ПериодичностьФормированияВычетовИВосстановленийНДС,
							|Учитывать5ПроцентныйПорог,
							|ВариантУчетаНДСПриИзмененииВидаДеятельности,
							|ПравилоОтбораАвансовДляРегистрацииСчетовФактур";
	НастройкиНалоговУчетныхПолитик.ДополнитьТекстыЗапросаПоказателейСтатистики("НастройкиУчетаНДС", ПоказателиСтатистики, ТекстыЗапросов);
	

	//-- Локализация
	
КонецПроцедуры

// Функция - агрегатор сведений о настройках налогового учета на определенную дату
//
// Параметры:
//  Период       - Дата - дата чтения настроек.
//  Организация  - СправочникСсылка.Организации - организация,
//                 для которой требуется получить настройки.
// 
// Возвращаемое значение:
//  Неопределено, ТаблицаЗначений - если нет ни одной записи настроек учета неопределено, иначе таблица.
//
Функция УчетнаяПолитикаНалоговыйУчет(Период, Организация) Экспорт
	Возврат Неопределено;
КонецФункции

// Возвращает признак использования раздельного учета товаров по налогообложению НДС. 
//
// Параметры:
// 	Организация - СправочникСсылка.Организации - Организация, для которой необходимо получить признак учетной политики
// 	Период 		- Дата, Неопределено - Дата действия учетной политики, если Неопределено, то на текущую дату
//
// Возвращаемое значение:
//	Булево - Значение признака
// 
Функция РаздельныйУчетТоваровПоНалогообложениюНДС(Организация, Период = Неопределено) Экспорт
	
	РаздельныйУчетТоваровПоНалогообложениюНДС = Ложь;
	
	//++ Локализация
	ПараметрыПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитикНаДату("НастройкиУчетаНДС",
		Организация,
		Период);
		
	РаздельныйУчетТоваровПоНалогообложениюНДС = ?(ПараметрыПолитики <> Неопределено, ПараметрыПолитики.РаздельныйУчетТоваровПоНалогообложениюНДС, Ложь);
	//-- Локализация
	Возврат РаздельныйУчетТоваровПоНалогообложениюНДС;
	
КонецФункции

// Возвращает признак использования раздельного учета ВНА по налогообложению НДС. 
//
// Параметры:
// 	Организация - СправочникСсылка.Организации - Организация, для которой необходимо получить признак учетной политики
// 	Период 		- Дата, Неопределено - Дата действия учетной политики, если Неопределено, то на текущую дату
//
// Возвращаемое значение:
//	Булево - Значение признака
// 
Функция РаздельныйУчетВНАПоНалогообложениюНДС(Организация, Период = Неопределено) Экспорт
	
	РаздельныйУчетВНАПоНалогообложениюНДС = Ложь;
	
	//++ Локализация
	ПараметрыПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитикНаДату("НастройкиУчетаНДС",
		Организация,
		Период);
		
	РаздельныйУчетВНАПоНалогообложениюНДС = ?(ПараметрыПолитики <> Неопределено, ПараметрыПолитики.РаздельныйУчетВНАПоНалогообложениюНДС, Ложь);
	//-- Локализация
	Возврат РаздельныйУчетВНАПоНалогообложениюНДС;
	
КонецФункции

// Возвращает признак использования раздельного учета постатейных производственных затрат по налогообложению НДС. 
//
// Параметры:
// 	Организация - СправочникСсылка.Организации - Организация, для которой необходимо получить признак учетной политики
// 	Период 		- Дата, Неопределено - Дата действия учетной политики, если Неопределено, то на текущую дату
//
// Возвращаемое значение:
//	Булево - Значение признака
// 
Функция РаздельныйУчетПостатейныхПроизводственныхЗатратПоНалогообложениюНДС(Организация, Период = Неопределено) Экспорт
	
	РаздельныйУчетПостатейныхПроизводственныхЗатратПоНалогообложениюНДС = Ложь;
	
	//++ Локализация
	ПараметрыПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитикНаДату("НастройкиУчетаНДС",
		Организация,
		Период);
		
	РаздельныйУчетПостатейныхПроизводственныхЗатратПоНалогообложениюНДС = ?(ПараметрыПолитики <> Неопределено, ПараметрыПолитики.РаздельныйУчетПостатейныхПроизводственныхЗатратПоНалогообложениюНДС, Ложь);
	//-- Локализация
	Возврат РаздельныйУчетПостатейныхПроизводственныхЗатратПоНалогообложениюНДС;
	
КонецФункции

Процедура НастройкиУчетаНДСПередЗаписью(СтрокаНабора) Экспорт
	//++ Локализация
	СтрокаНабора.РаздельныйУчетВНАПоНалогообложениюНДС = СтрокаНабора.РаздельныйУчетТоваровПоНалогообложениюНДС;
	//-- Локализация
КонецПроцедуры

// Получает актуальные данные учетной политики налогового учета. 
//
// Параметры:
//	Форма - Структура - ФормаЗаписи регистра сведений УчетнаяПолитикаФинансовогоУчета:
// 	 * Запись - РегистрСведенийМенеджерЗаписи.УчетнаяПолитикаФинансовогоУчета - 
// 	 * ПрименяетсяУСН - Булево -
//	 * ПрименяетсяУСНДоходыМинусРасходы - Булево - 
//
Процедура ПрочитатьЗаписьРегистра_УчетнаяПолитикаФинУчета(Форма) Экспорт
	
	//++ Локализация
	ДействующиеПараметры = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитикНаДату("НастройкиСистемыНалогообложения",
		Форма.Запись.Организация,
		Форма.Запись.Период,
		Истина);
		
	Если ЗначениеЗаполнено(ДействующиеПараметры) Тогда
		Форма.ПрименяетсяУСН = ДействующиеПараметры.ПрименяетсяУСН;
	Иначе
		Форма.ПрименяетсяУСН = Ложь;
	КонецЕсли;
	

	ДействующиеПараметрыУСН = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитикНаДату("НастройкиУчетаУСН",
		Форма.Запись.Организация,
		Форма.Запись.Период,
		Истина);
		
	Если ЗначениеЗаполнено(ДействующиеПараметрыУСН) Тогда
		Форма.ПрименяетсяУСНДоходыМинусРасходы = ДействующиеПараметрыУСН.ПрименяетсяУСНДоходыМинусРасходы;
	Иначе
		Форма.ПрименяетсяУСНДоходыМинусРасходы = Ложь;
	КонецЕсли;
	//-- Локализация

КонецПроцедуры
 
#КонецОбласти
